HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMsc_bf.h
/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL19 */
#define IFX_MSC_ESRE_ENL19_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL19 */
#define IFX_MSC_ESRE_ENL19_OFF (3u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL20 */
#define IFX_MSC_ESRE_ENL20_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL20 */
#define IFX_MSC_ESRE_ENL20_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL20 */
#define IFX_MSC_ESRE_ENL20_OFF (4u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL21 */
#define IFX_MSC_ESRE_ENL21_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL21 */
#define IFX_MSC_ESRE_ENL21_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL21 */
#define IFX_MSC_ESRE_ENL21_OFF (5u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL22 */
#define IFX_MSC_ESRE_ENL22_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL22 */
#define IFX_MSC_ESRE_ENL22_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL22 */
#define IFX_MSC_ESRE_ENL22_OFF (6u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL23 */
#define IFX_MSC_ESRE_ENL23_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL23 */
#define IFX_MSC_ESRE_ENL23_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL23 */
#define IFX_MSC_ESRE_ENL23_OFF (7u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL24 */
#define IFX_MSC_ESRE_ENL24_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL24 */
#define IFX_MSC_ESRE_ENL24_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL24 */
#define IFX_MSC_ESRE_ENL24_OFF (8u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL25 */
#define IFX_MSC_ESRE_ENL25_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL25 */
#define IFX_MSC_ESRE_ENL25_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL25 */
#define IFX_MSC_ESRE_ENL25_OFF (9u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL26 */
#define IFX_MSC_ESRE_ENL26_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL26 */
#define IFX_MSC_ESRE_ENL26_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL26 */
#define IFX_MSC_ESRE_ENL26_OFF (10u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL27 */
#define IFX_MSC_ESRE_ENL27_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL27 */
#define IFX_MSC_ESRE_ENL27_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL27 */
#define IFX_MSC_ESRE_ENL27_OFF (11u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL28 */
#define IFX_MSC_ESRE_ENL28_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL28 */
#define IFX_MSC_ESRE_ENL28_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL28 */
#define IFX_MSC_ESRE_ENL28_OFF (12u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL29 */
#define IFX_MSC_ESRE_ENL29_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL29 */
#define IFX_MSC_ESRE_ENL29_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL29 */
#define IFX_MSC_ESRE_ENL29_OFF (13u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL30 */
#define IFX_MSC_ESRE_ENL30_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL30 */
#define IFX_MSC_ESRE_ENL30_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL30 */
#define IFX_MSC_ESRE_ENL30_OFF (14u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENL31 */
#define IFX_MSC_ESRE_ENL31_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENL31 */
#define IFX_MSC_ESRE_ENL31_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENL31 */
#define IFX_MSC_ESRE_ENL31_OFF (15u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH16 */
#define IFX_MSC_ESRE_ENH16_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH16 */
#define IFX_MSC_ESRE_ENH16_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH16 */
#define IFX_MSC_ESRE_ENH16_OFF (16u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH17 */
#define IFX_MSC_ESRE_ENH17_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH17 */
#define IFX_MSC_ESRE_ENH17_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH17 */
#define IFX_MSC_ESRE_ENH17_OFF (17u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH18 */
#define IFX_MSC_ESRE_ENH18_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH18 */
#define IFX_MSC_ESRE_ENH18_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH18 */
#define IFX_MSC_ESRE_ENH18_OFF (18u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH19 */
#define IFX_MSC_ESRE_ENH19_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH19 */
#define IFX_MSC_ESRE_ENH19_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH19 */
#define IFX_MSC_ESRE_ENH19_OFF (19u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH20 */
#define IFX_MSC_ESRE_ENH20_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH20 */
#define IFX_MSC_ESRE_ENH20_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH20 */
#define IFX_MSC_ESRE_ENH20_OFF (20u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH21 */
#define IFX_MSC_ESRE_ENH21_OFF (21u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH22 */
#define IFX_MSC_ESRE_ENH22_OFF (22u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH23 */
#define IFX_MSC_ESRE_ENH23_OFF (23u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH24 */
#define IFX_MSC_ESRE_ENH24_OFF (24u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH25 */
#define IFX_MSC_ESRE_ENH25_OFF (25u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH26 */
#define IFX_MSC_ESRE_ENH26_OFF (26u)

