HAMES2-1st-3/TunnelComfortSystemTesting/include/tc37xa/IfxMsc_bf.h
/** \brief Length for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH27 */
#define IFX_MSC_ESRE_ENH27_OFF (27u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH28 */
#define IFX_MSC_ESRE_ENH28_OFF (28u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH29 */
#define IFX_MSC_ESRE_ENH29_OFF (29u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH30 */
#define IFX_MSC_ESRE_ENH30_OFF (30u)

/** \brief Length for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_LEN (1u)

/** \brief Mask for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ESRE_Bits.ENH31 */
#define IFX_MSC_ESRE_ENH31_OFF (31u)

/** \brief Length for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_LEN (2u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_MSK (0x3u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.PPDE */
#define IFX_MSC_DSTE_PPDE_OFF (0u)

/** \brief Length for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_LEN (6u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_MSK (0x3fu)

/** \brief Offset for Ifx_MSC_DSTE_Bits.PPCE */
#define IFX_MSC_DSTE_PPCE_OFF (2u)

/** \brief Length for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_LEN (4u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_MSK (0xfu)

/** \brief Offset for Ifx_MSC_DSTE_Bits.NDD */
#define IFX_MSC_DSTE_NDD_OFF (8u)

/** \brief Length for Ifx_MSC_DSTE_Bits.PPCEM */
#define IFX_MSC_DSTE_PPCEM_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.PPCEM */
#define IFX_MSC_DSTE_PPCEM_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.PPCEM */
#define IFX_MSC_DSTE_PPCEM_OFF (12u)

/** \brief Length for Ifx_MSC_DSTE_Bits.FM */
#define IFX_MSC_DSTE_FM_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.FM */
#define IFX_MSC_DSTE_FM_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.FM */
#define IFX_MSC_DSTE_FM_OFF (16u)

/** \brief Length for Ifx_MSC_DSTE_Bits.CX */
#define IFX_MSC_DSTE_CX_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.CX */
#define IFX_MSC_DSTE_CX_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.CX */
#define IFX_MSC_DSTE_CX_OFF (28u)

/** \brief Length for Ifx_MSC_DSTE_Bits.UL1 */
#define IFX_MSC_DSTE_UL1_LEN (1u)

/** \brief Mask for Ifx_MSC_DSTE_Bits.UL1 */
#define IFX_MSC_DSTE_UL1_MSK (0x1u)

/** \brief Offset for Ifx_MSC_DSTE_Bits.UL1 */
#define IFX_MSC_DSTE_UL1_OFF (31u)

/** \brief Length for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_LEN (16u)

/** \brief Mask for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDM_Bits.DDLM */
#define IFX_MSC_DDM_DDLM_OFF (0u)

/** \brief Length for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_LEN (16u)

/** \brief Mask for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDM_Bits.DDHM */
#define IFX_MSC_DDM_DDHM_OFF (16u)

/** \brief Length for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_LEN (16u)

/** \brief Mask for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDE_Bits.DDLE */
#define IFX_MSC_DDE_DDLE_OFF (0u)

/** \brief Length for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_LEN (16u)

/** \brief Mask for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DDE_Bits.DDHE */
#define IFX_MSC_DDE_DDHE_OFF (16u)

/** \brief Length for Ifx_MSC_DCM_Bits.DCLM */
#define IFX_MSC_DCM_DCLM_LEN (16u)

/** \brief Mask for Ifx_MSC_DCM_Bits.DCLM */
#define IFX_MSC_DCM_DCLM_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DCM_Bits.DCLM */
#define IFX_MSC_DCM_DCLM_OFF (0u)

/** \brief Length for Ifx_MSC_DCM_Bits.DCHM */
#define IFX_MSC_DCM_DCHM_LEN (16u)

/** \brief Mask for Ifx_MSC_DCM_Bits.DCHM */
#define IFX_MSC_DCM_DCHM_MSK (0xffffu)

/** \brief Offset for Ifx_MSC_DCM_Bits.DCHM */
#define IFX_MSC_DCM_DCHM_OFF (16u)

/** \brief Length for Ifx_MSC_DCE_Bits.DCEH */
#define IFX_MSC_DCE_DCEH_LEN (32u)

/** \brief Mask for Ifx_MSC_DCE_Bits.DCEH */
#define IFX_MSC_DCE_DCEH_MSK (0xffffffffu)

/** \brief Offset for Ifx_MSC_DCE_Bits.DCEH */
#define IFX_MSC_DCE_DCEH_OFF (0u)

/** \brief Length for Ifx_MSC_ABC_Bits.LOW */
#define IFX_MSC_ABC_LOW_LEN (4u)

/** \brief Mask for Ifx_MSC_ABC_Bits.LOW */
#define IFX_MSC_ABC_LOW_MSK (0xfu)

/** \brief Offset for Ifx_MSC_ABC_Bits.LOW */
#define IFX_MSC_ABC_LOW_OFF (0u)

/** \brief Length for Ifx_MSC_ABC_Bits.HIGH */
#define IFX_MSC_ABC_HIGH_LEN (4u)

/** \brief Mask for Ifx_MSC_ABC_Bits.HIGH */
#define IFX_MSC_ABC_HIGH_MSK (0xfu)

/** \brief Offset for Ifx_MSC_ABC_Bits.HIGH */
#define IFX_MSC_ABC_HIGH_OFF (4u)

/** \brief Length for Ifx_MSC_ABC_Bits.OIP */
#define IFX_MSC_ABC_OIP_LEN (2u)

/** \brief Mask for Ifx_MSC_ABC_Bits.OIP */
#define IFX_MSC_ABC_OIP_MSK (0x3u)

/** \brief Offset for Ifx_MSC_ABC_Bits.OIP */
#define IFX_MSC_ABC_OIP_OFF (8u)

/** \brief Length for Ifx_MSC_ABC_Bits.OASR */
#define IFX_MSC_ABC_OASR_LEN (1u)

/** \brief Mask for Ifx_MSC_ABC_Bits.OASR */
#define IFX_MSC_ABC_OASR_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ABC_Bits.OASR */
#define IFX_MSC_ABC_OASR_OFF (10u)

/** \brief Length for Ifx_MSC_ABC_Bits.OVF */
#define IFX_MSC_ABC_OVF_LEN (1u)

/** \brief Mask for Ifx_MSC_ABC_Bits.OVF */
#define IFX_MSC_ABC_OVF_MSK (0x1u)

/** \brief Offset for Ifx_MSC_ABC_Bits.OVF */
#define IFX_MSC_ABC_OVF_OFF (12u)

